Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceZeroLengthSplittingCurve Property
 Curve element with zero length cannot be used as a splitter and ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceZeroLengthSplittingCurve { get; }
Public Shared ReadOnly Property DividedSurfaceZeroLengthSplittingCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceZeroLengthSplittingCurve {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceZeroLengthSplittingCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace